TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1117/driverlib/empty_driverlib_src/ti/driverlib/m0p/sysctl/dl_sysctl_mspm0gx51x.h
    return (DL_SYSCTL_RESET_CAUSE)(resetCause);
}

/**
 *  @brief     Set the HFXT startup time
 *
 * Specify the HFXT startup time in 64us resolution. If the HFCLK startup
 * monitor is enabled (HFCLKFLTCHK), HFXT will be checked after this time
 * expires.
 *
 *  @param[in]  startupTime  The HFXT startup time to set in ~64us steps.
 *                           Value between [0x0 (~0s), 0xFF (~16.32ms)].
 */
__STATIC_INLINE void DL_SYSCTL_setHFXTStartupTime(uint32_t startupTime)
{
    DL_Common_updateReg(&SYSCTL->SOCLOCK.HFCLKCLKCFG, startupTime,
        SYSCTL_HFCLKCLKCFG_HFXTTIME_MASK);
}

/**
 *  @brief   Get the HFXT startup time
 *
 *  @return  Returns the HFXT startup time in ~64us steps
 *
 *  @retval  Value between [0x0 (~0s), 0xFF (~16.32ms)]
 */
__STATIC_INLINE uint32_t DL_SYSCTL_getHFXTStartupTime(void)
{
    return (SYSCTL->SOCLOCK.HFCLKCLKCFG & SYSCTL_HFCLKCLKCFG_HFXTTIME_MASK);
}

/**
 *  @brief     Set the HFXT frequency range
 *
 * The high frequency crystal oscillator (HFXT) can be used with standard
 * crystals and resonators in the 4-48MHz range to generate a stable high-speed
 * reference clock for the system.
 *
 *  @param[in]  range  One of @ref DL_SYSCTL_HFXT_RANGE
 */
__STATIC_INLINE void DL_SYSCTL_setHFXTFrequencyRange(
    DL_SYSCTL_HFXT_RANGE range)
{
    DL_Common_updateReg(&SYSCTL->SOCLOCK.HFCLKCLKCFG, ((uint32_t) range),
        SYSCTL_HFCLKCLKCFG_HFXTRSEL_MASK);
}

/**
 *  @brief   Get the HFXT frequency range
 *
 *  @return  Returns the HFXT frequency range
 *
 *  @retval  One of @ref DL_SYSCTL_HFXT_RANGE
 */
__STATIC_INLINE DL_SYSCTL_HFXT_RANGE DL_SYSCTL_getHFXTFrequencyRange(void)
{
    uint32_t range =
        (SYSCTL->SOCLOCK.HFCLKCLKCFG & SYSCTL_HFCLKCLKCFG_HFXTRSEL_MASK) >>
        SYSCTL_HFCLKCLKCFG_HFXTRSEL_OFS;

    return (DL_SYSCTL_HFXT_RANGE)(range);
}

/**
 *  @brief  Enable the HFCLK startup monitor
 *
 * The HFXT takes time to start after being enabled. A startup monitor is
 * provided to indicate to the application software if the HFXT has successfully
 * started, at which point the HFCLK can be selected to source a variety of
 * system functions. The HFCLK startup monitor also supports checking the
 * HFCLK_IN digital clock input for a clock stuck fault.
 *
 */
__STATIC_INLINE void DL_SYSCTL_enableHFCLKStartupMonitor(void)
{
    SYSCTL->SOCLOCK.HFCLKCLKCFG |= SYSCTL_HFCLKCLKCFG_HFCLKFLTCHK_ENABLE;
}

/**
 *  @brief  Disable the HFCLK startup monitor
 */
__STATIC_INLINE void DL_SYSCTL_disableHFCLKStartupMonitor(void)
{
    SYSCTL->SOCLOCK.HFCLKCLKCFG &= ~(SYSCTL_HFCLKCLKCFG_HFCLKFLTCHK_MASK);
}

/**
 *  @brief  Retrieves the calibration constant of the temperature sensor to be
 *          used in temperature calculation.
 *
 *  @retval Temperature sensor calibration data
 */
__STATIC_INLINE uint32_t DL_SYSCTL_getTempCalibrationConstant(void)
{
    return DL_FactoryRegion_getTemperatureVoltage();
}

/**
 *  @brief  Initializes the Read Execute (RX) Protect Firewall
 *
 *  The firewall security configuration can only be configured if INITDONE has
 *  not been issued by the CSC.
 *  This API checks if INITDONE has been issued. If it has not been issued,
 *  then the start and end addresses are set, and then it enables the firewall.
 *  If INITDONE has been issused, then the API immediately returns.
 *
 *  @param[in] startAddr  The start address of the read execute protect firewall
 *  @param[in] endAddr    The end address of the read execute protect firewall
 *
 *  @return  If the Read Execute Protect Firewall was configured
 *
 *  @retval  true  If INITDONE was not issued and the firewall was configured
 *  @retval  false If INITDONE was issued and the firewall was not configured
 */
bool DL_SYSCTL_initReadExecuteProtectFirewall(
    uint32_t startAddr, uint32_t endAddr);

/**
 *  @brief  Initializes the IP Protect Firewall
 *
 *  The firewall security configuration can only be configured if INITDONE has
 *  not been issued by the CSC.
 *  This API checks if INITDONE has been issued. If it has not been issued,
 *  then the start and end addresses are set, and then it enables the firewall.
 *  If INITDONE has been issused, then the API immediately returns.
 *
 *  @param[in] startAddr  The start address of the IP protect firewall
 *  @param[in] endAddr    The end address of the IP protect firewall
 *
 *  @return  If the IP Protect Firewall was configured
 *
 *  @retval  true  If INITDONE was not issued and the firewall was configured
 *  @retval  false If INITDONE was issued and the firewall was not configured
 */
bool DL_SYSCTL_initIPProtectFirewall(uint32_t startAddr, uint32_t endAddr);

/**
 *  @brief  Set the address range of the Write Protect Firewall
 *
 *  Set Write Protection starting at 0x0 of flash, for the first
 *  32KB at 1KB granularity.
 *  Setting a bit to 1 enables write protection, and setting a bit to 0
 *  allows write.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST.
 *
 *  @param[in] addrMask The mask to set the address range for the Write Protect
 *                      Firewall
 */
__STATIC_INLINE void DL_SYSCTL_setWriteProtectFirewallAddrRange(
    uint32_t addrMask)
{
    SYSCTL->SECCFG.FWEPROTMAIN = addrMask;
}

/**
 *  @brief  Get the address range of the Write Protect Firewall
 *
 *  @retval The address range for the Write Protect Firewall
 */
__STATIC_INLINE uint32_t DL_SYSCTL_getWriteProtectFirewallAddrRange(void)
{
    return (SYSCTL->SECCFG.FWEPROTMAIN);
}

/**
 *  @brief  Set the Read Write Protect Firewall for the Flash DATA Bank
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST.
 *
 *  @param[in] protectionType The type of protection to set for the DATA Bank.
 *                            One of @ref DL_SYSCTL_DATA_BANK_READ_WRITE_PROTECT_FIREWALL
 */
__STATIC_INLINE void DL_SYSCTL_setDATABankRWProtectFirewallMode(
    DL_SYSCTL_DATA_BANK_READ_WRITE_PROTECT_FIREWALL protectionType)
{
    SYSCTL->SECCFG.FWPROTMAINDATA = (uint32_t) protectionType;
}

/**
 *  @brief  Get the protection type for the Read Write Protect Firewall for the Flash DATA Bank
 *
 *  @return The protection type for the Read Write Protect Firewall for the Flash DATA Bank
 *
 *  @retval One of @ref DL_SYSCTL_DATA_BANK_READ_WRITE_PROTECT_FIREWALL
 */
__STATIC_INLINE DL_SYSCTL_DATA_BANK_READ_WRITE_PROTECT_FIREWALL
DL_SYSCTL_getDATABankRWProtectFirewallMode(void)
{
    return (DL_SYSCTL_DATA_BANK_READ_WRITE_PROTECT_FIREWALL)(
        SYSCTL->SECCFG.FWPROTMAINDATA);
}

/**
 *  @brief  Set the start address of the Read Execute (RX) Protect Firewall
 *
 *  Set the start of the range of Flash MAIN memory that needs to be guarded
 *  from both read and execute accesses. The firewall is configured as an
 *  address range.
 *
 *  The start and end addresses are specified at 64B sector granularity, so
 *  the 6 LSBs are don't cares.
 *  If the start address is equal to the end address, then one sector is RX
 *  protected. If the end address is equal to the start address + 1, then two
 *  sectors are protected, and so on. If the end address is less than the start
 *  address, the no sectors are RX protected. The hardware does not perform any
 *  checks on the addresses.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST.
 *
 *  @param[in] startAddr  The start address of the read execute protect
 *                        firewall. The 6 LSBs are don't cares.
 */
__STATIC_INLINE void DL_SYSCTL_setReadExecuteProtectFirewallAddrStart(
    uint32_t startAddr)
{
    SYSCTL->SECCFG.FRXPROTMAINSTART =
        (startAddr & SYSCTL_FRXPROTMAINSTART_ADDR_MASK);
}

/**
 *  @brief  Get the start address of the Read Execute (RX) Protect Firewall
 *
 *  The start and end addresses are specified at 64B sector granularity, so
 *  the 6 LSBs are don't cares.
 *
 *  @return  The start address of the read execute protect firewall
 */
__STATIC_INLINE uint32_t DL_SYSCTL_getReadExecuteProtectFirewallAddrStart(void)
{
    return (SYSCTL->SECCFG.FRXPROTMAINSTART);
}

/**
 *  @brief  Set the end address of the Read Execute (RX) Protect Firewall
 *
 *  Set the end of the range of Flash MAIN memory that needs to be guarded
 *  from both read and execute accesses. The firewall is configured as an
 *  address range.
 *
 *  The start and end addresses are specified at 64B sector granularity, so
 *  the 6 LSBs are don't cares.
 *  If the start address is equal to the end address, then one sector is RX
 *  protected. If the end address is equal to the start address + 1, then two
 *  sectors are protected, and so on. If the end address is less than the start
 *  address, the no sectors are RX protected. The hardware does not perform any
 *  checks on the addresses.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST.
 *
 *  @param[in] endAddr  The end address of the read execute protect firewall.
 *                      The 6 LSBs are don't cares.
 */
__STATIC_INLINE void DL_SYSCTL_setReadExecuteProtectFirewallAddrEnd(
    uint32_t endAddr)
{
    SYSCTL->SECCFG.FRXPROTMAINEND =
        (endAddr & SYSCTL_FRXPROTMAINEND_ADDR_MASK);
}

/**
 *  @brief  Get the end address of the Read Execute (RX) Protect Firewall
 *
 *  The start and end addresses are specified at 64B sector granularity, so
 *  the 6 LSBs are don't cares.
 *
 *  @return  The end address of the Read Execute Protect Firewall
 */
__STATIC_INLINE uint32_t DL_SYSCTL_getReadExecuteProtectFirewallAddrEnd(void)
{
    return (SYSCTL->SECCFG.FRXPROTMAINEND);
}

/**
 *  @brief  Set the start address of the IP Protect Firewall
 *
 *  Set the end of the range of Flash MAIN memory that needs to be guarded
 *  from read access, allowing only execute accesses. The firewall is configured
 *  as an address range.
 *
 *  The start and end addresses are specified at 64B sector granularity, so
 *  the 6 LSBs are don't cares.
 *  If the start address is equal to the end address, then one sector is IP
 *  protected. If the end address is equal to the start address + 1, then two
 *  sectors are protected, and so on. If the end address is less than the start
 *  address, the no sectors are IP protected. The hardware does not perform any
 *  checks on the addresses.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST.
 *
 *  @param[in] startAddr  The start address of the IP Protect Firewall
 */
__STATIC_INLINE void DL_SYSCTL_setIPProtectFirewallAddrStart(
    uint32_t startAddr)
{
    SYSCTL->SECCFG.FIPPROTMAINSTART =
        (startAddr & SYSCTL_FIPPROTMAINSTART_ADDR_MASK);
}

/**
 *  @brief  Get the start address of the IP Protect Firewall
 *
 *  @return  The start address of the IP Protect Firewall
 */
__STATIC_INLINE uint32_t DL_SYSCTL_getIPProtectFirewallAddrStart(void)
{
    return (SYSCTL->SECCFG.FIPPROTMAINSTART);
}

/**
 *  @brief  Set the end address of the IP Protect firewall
 *
 *  Set the end of the range of Flash MAIN memory that needs to be guarded
 *  from read access, allowing only execute accesses. The firewall is configured
 *  as an address range.
 *
 *  The start and end addresses are specified at 64B sector granularity, so
 *  the 6 LSBs are don't cares.
 *  If the start address is equal to the end address, then one sector is IP
 *  protected. If the end address is equal to the start address + 1, then two
 *  sectors are protected, and so on. If the end address is less than the start
 *  address, the no sectors are IP protected. The hardware does not perform any
 *  checks on the addresses.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST.
 *
 *  @param[in] endAddr  The end address of the IP Protect firewall
 */
__STATIC_INLINE void DL_SYSCTL_setIPProtectFirewallAddrEnd(uint32_t endAddr)
{
    SYSCTL->SECCFG.FIPPROTMAINSTART =
        (endAddr & SYSCTL_FIPPROTMAINEND_ADDR_MASK);
}

/**
 *  @brief  Get the end address of the IP Protect Firewall
 *
 *  @return  The end address of the IP Protect Firewall
 */
__STATIC_INLINE uint32_t DL_SYSCTL_getIPProtectFirewallAddrEnd(void)
{
    return (SYSCTL->SECCFG.FIPPROTMAINSTART);
}

/**
 *  @brief  Enable the policy to allow flash bank swapping
 *
 *  The bank swap policy needs to be configured ahead of any bank swapping or
 *  firewall configurations. In dual/quad-bank devices, this policy can be set
 *  to either
 *      - CSC allows bank swapping
 *      - CSC does not allow bank swapping
 *
 *  By default, bank swapping is enabled to ensure a high security state if the
 *  system boot execution was glitched. Defaulting the system as allowing bank
 *  swapping ensures that firewall protections get mirrored to both flash banks.
 *  Additionally, when bank swapping is enabled, SYSCTL enforces write-excute
 *  mutual exclusion across the two banks (or bank-pairs).
 *
 *  @note This is a write-once bit. This bit can only be written to before
 *        INITDONE. At INITDONE, this bit becomes a read-only bit until next
 *        BOOTRST.
 */
__STATIC_INLINE void DL_SYSCTL_enableFlashBankSwap(void)
{
    SYSCTL->SECCFG.FLBANKSWPPOLICY &= (~(SYSCTL_FLBANKSWPPOLICY_DISABLE_MASK) |
                                       SYSCTL_FLBANKSWPPOLICY_KEY_VALUE);
}

/**
 *  @brief  Disable the policy to allow flash bank swapping
 *
 *  The bank swap policy needs to be configured ahead of any bank swapping or
 *  firewall configurations. In dual/quad-bank devices, this policy can be set
 *  to either
 *      - CSC allows bank swapping
 *      - CSC does not allow bank swapping
 *
 *  By default, bank swapping is enabled to ensure a high security state if the
 *  system boot execution was glitched. Defaulting the system as allowing bank
 *  swapping ensures that firewall protections get mirrored to both flash banks.
 *  Additionally, when bank swapping is enabled, SYSCTL enforces write-excute
 *  mutual exclusion across the two banks (or bank-pairs).
 *
 *  @note This is a write-once bit. This bit can only be written to before
 *        INITDONE. At INITDONE, this bit becomes a read-only bit until next
 *        BOOTRST.
 */
__STATIC_INLINE void DL_SYSCTL_disableFlashBankSwap(void)
{
    SYSCTL->SECCFG.FLBANKSWPPOLICY = (SYSCTL_FLBANKSWPPOLICY_DISABLE_TRUE |
                                      SYSCTL_FLBANKSWPPOLICY_KEY_VALUE);
}

/**
 *  @brief      Perform bank swap and execute from the Upper Flash Bank
 *
 *  The upper physical bank maps to logical 0x0, and gets RX permission.
 *  The lower physical bank gets RW permission.
 *
 *  @note This bit can only be written to before INITDONE. At INITDONE, this bit
 *  becomes a read-only bit until next BOOTRST.
 *
 *  @pre  DL_SYSCTL_enableFlashBankSwap
 */
__STATIC_INLINE void DL_SYSCTL_executeFromUpperFlashBank(void)
{
    SYSCTL->SECCFG.FLBANKSWP |=
        (SYSCTL_FLBANKSWP_USEUPPER_ENABLE | SYSCTL_FLBANKSWP_KEY_VALUE);
}

/**
 *  @brief      Perform bank swap and execute from the Lower Flash Bank
 *
 *  The lower physical bank maps to logical 0x0, and gets RX permission.
 *  The upper physical bank gets RW permission.
 *
 *  @note This bit can only be written to before INITDONE. At INITDONE, this bit
 *  becomes a read-only bit until next BOOTRST.
 *
 *  @pre  DL_SYSCTL_enableFlashBankSwap
 */
__STATIC_INLINE void DL_SYSCTL_executeFromLowerFlashBank(void)
{
    SYSCTL->SECCFG.FLBANKSWP &=
        (~(SYSCTL_FLBANKSWP_USEUPPER_MASK) | SYSCTL_FLBANKSWP_KEY_VALUE);
}

/**
 *  @brief      Enable Read Execute (RX) Protect Firewall
 *
 *  Enables the Read Execute Protect Firewall before INITDONE.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST
 */
__STATIC_INLINE void DL_SYSCTL_enableReadExecuteProtectFirewall(void)
{
    SYSCTL->SECCFG.FWENABLE |=
        (SYSCTL_FWENABLE_FLRXPROT_ENABLE | SYSCTL_FWENABLE_KEY_VALUE);
}

/**
 *  @brief      Enable IP Protect Firewall
 *
 *  Enables the IP Protect Firewall before INITDONE. After INITDONE,
 *  this configuration gets locked until the next BOOTRST.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST
 */
__STATIC_INLINE void DL_SYSCTL_enableIPProtectFirewall(void)
{
    SYSCTL->SECCFG.FWENABLE |=
        (SYSCTL_SECSTATUS_FLIPPROT_ENABLED | SYSCTL_FWENABLE_KEY_VALUE);
}

/**
 *  @brief      Enable SRAM Boundary Lock
 *
 *  When SRAM Boundary Lock is enabled, the SRAMBOUNDARY register is only
 *  writeable only until INITDONE. After INITDONE, the SRAMBOUNDARY register
 *  cannot be written.
 *
 *  When disabled, the SRAMBOUNDARY register is writeable throughout the
 *  application, even after INITDONE.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST
 *
 *  @sa DL_SYSCTL_setSRAMBoundaryAddress
 */
__STATIC_INLINE void DL_SYSCTL_enableSRAMBoundaryLock(void)
{
    SYSCTL->SECCFG.FWENABLE |=
        (SYSCTL_FWENABLE_SRAMBOUNDARYLOCK_ENABLE | SYSCTL_FWENABLE_KEY_VALUE);
}

/**
 *  @brief  Checks if INITDONE has been issued by the CSC
 *
 *  @return Whether INITDONE has been issued or not
 *
 *  @retval  true  If INITDONE has been issued
 *  @retval  false If INITDONE has not been issued
 */
__STATIC_INLINE bool DL_SYSCTL_isINITDONEIssued(void)
{
    return ((SYSCTL->SECCFG.SECSTATUS & SYSCTL_SECSTATUS_INITDONE_YES) ==
            SYSCTL_SECSTATUS_INITDONE_YES);
}

/**
 *  @brief  Checks if Customer Startup Code (CSC) exists in system
 *
 *  @return Whether CSC exists in system
 *
 *  @retval  true  If CSC exists in system
 *  @retval  false If CSC does not exist in system
 */
__STATIC_INLINE bool DL_SYSCTL_ifCSCExists(void)
{
    return ((SYSCTL->SECCFG.SECSTATUS & SYSCTL_SECSTATUS_CSCEXISTS_YES) ==
            SYSCTL_SECSTATUS_CSCEXISTS_YES);
}

/**
 *  @brief  Checks if Read Execute (RX) Protect Firewall is enabled
 *
 *  @return Whether Read Execute Protect Firewall is enabled
 *
 *  @retval  true  If Read Execute Protect Firewall is enabled
 *  @retval  false If Read Execute Protect Firewall is not enabled
 */
__STATIC_INLINE bool DL_SYSCTL_isReadExecuteProtectFirewallEnabled(void)
{
    return ((SYSCTL->SECCFG.SECSTATUS & SYSCTL_SECSTATUS_FLRXPROT_ENABLED) ==
            SYSCTL_SECSTATUS_FLRXPROT_ENABLED);
}

/**
 *  @brief  Checks if IP Protect Firewall is enabled
 *
 *  @return Whether IP Protect Firewall is enabled
 *
 *  @retval  true  If IP Protect Firewall is enabled
 *  @retval  false If IP Protect Firewall is not enabled
 */
__STATIC_INLINE bool DL_SYSCTL_isIPProtectFirewallEnabled(void)
{
    return ((SYSCTL->SECCFG.SECSTATUS & SYSCTL_SECSTATUS_FLIPPROT_ENABLED) ==
            SYSCTL_SECSTATUS_FLIPPROT_ENABLED);
}

/**
 *  @brief  Checks if SRAM Boundary Lock is enabled
 *
 *  @return Whether SRAM Boundary Lock is enabled
 *
 *  @retval  true  If SRAM Boundary Lock is enabled
 *  @retval  false If SRAM Boundary Lock is not enabled
 */
__STATIC_INLINE bool DL_SYSCTL_isSRAMBoundaryLocked(void)
{
    return ((SYSCTL->SECCFG.SECSTATUS &
                SYSCTL_SECSTATUS_SRAMBOUNDARYLOCK_ENABLED) ==
            SYSCTL_SECSTATUS_SRAMBOUNDARYLOCK_ENABLED);
}

/**
 *  @brief  Checks if Flash Bank swapping is enabled
 *
 *  @return Whether Flash Bank swap is enabled
 *
 *  @retval  true  If Flash Bank swap is enabled
 *  @retval  false If Flash Bank swap is not enabled
 */
__STATIC_INLINE bool DL_SYSCTL_isFlashBankSwapEnabled(void)
{
    return ((SYSCTL->SECCFG.SECSTATUS &
                SYSCTL_SECSTATUS_FLBANKSWPPOLICY_ENABLED) ==
            SYSCTL_SECSTATUS_FLBANKSWPPOLICY_ENABLED);
}

/**
 *  @brief  Checks if executing from upper flash bank
 *
 *  @return Whether executing from upper flash bank
 *
 *  @retval  true  If executing from upper flash bank
 *  @retval  false If not executing from upper flash bank
 */
__STATIC_INLINE bool DL_SYSCTL_isExecuteFromUpperFlashBank(void)
{
    return ((SYSCTL->SECCFG.SECSTATUS & SYSCTL_SECSTATUS_FLBANKSWP_MASK) ==
            SYSCTL_SECSTATUS_FLBANKSWP_MASK);
}

/**
 *  @brief  Checks if executing from lower flash bank
 *
 *  @return Whether executing from lower flash bank
 *
 *  @retval  true  If executing from lower flash bank
 *  @retval  false If not executing from lower flash bank
 */
__STATIC_INLINE bool DL_SYSCTL_isExecuteFromLowerFlashBank(void)
{
    return ((SYSCTL->SECCFG.SECSTATUS & SYSCTL_SECSTATUS_FLBANKSWP_MASK) !=
            SYSCTL_SECSTATUS_FLBANKSWP_MASK);
}

/**
 *  @brief  Indicate that INIT is done
 *
 *  After INITDONE is issued, the security configuration is locked and enforced.
 *  A SYSRST will occur, restarting startup code execution, and the main
 *  application is launched.
 *
 *  There is no hardware support to enforce a timeout if INITDONE is not issued
 *  in a reasonable period of time. It is recommended that the CSC use a
 *  watchdog to ensure that INITDONE is issued in a timely manner.
 */
__STATIC_INLINE void DL_SYSCTL_issueINITDONE(void)
{
    SYSCTL->SECCFG.INITDONE |=
        (SYSCTL_INITDONE_PASS_TRUE | SYSCTL_INITDONE_KEY_VALUE);
}

/**
 *  @brief  Set the power level for SRAM Bank 1 when in RUN mode
 *
 *  @param[in] powerLevel The power level to set SRAM Bank 1 to when in RUN mode.
 *                        One of @ref DL_SYSCTL_SRAM_BANK1_POWER_LEVEL_RUN_MODE
 *
 */
__STATIC_INLINE void DL_SYSCTL_setSRAMBank1PowerLevelInRUN(
    DL_SYSCTL_SRAM_BANK1_POWER_LEVEL_RUN_MODE powerLevel)
{
    DL_Common_updateReg(&SYSCTL->SOCLOCK.SRAMCFG,
        ((uint32_t) powerLevel | SYSCTL_SRAMCFG_KEY_VALUE),
        (SYSCTL_SRAMCFG_BANKOFF1_MASK | SYSCTL_SRAMCFG_KEY_MASK));
}

/**
 *  @brief Get the power level SRAM Bank 1 power when in RUN mode
 *
 *  @return The power level of SRAM Bank 1 when in RUN mode
 *
 *  @retval  One of @ref DL_SYSCTL_SRAM_BANK1_POWER_LEVEL_RUN_MODE
 */
__STATIC_INLINE DL_SYSCTL_SRAM_BANK1_POWER_LEVEL_RUN_MODE
DL_SYSCTL_getSRAMBank1PowerLevelInRUN(void)
{
    uint32_t powerLevel =
        SYSCTL->SOCLOCK.SRAMCFG & SYSCTL_SRAMCFG_BANKOFF1_MASK;
    return (DL_SYSCTL_SRAM_BANK1_POWER_LEVEL_RUN_MODE)(powerLevel);
}

/**
 *  @brief  Set the power level for SRAM Bank 1 when in STOP mode
 *
 *  @param[in] powerLevel The power level to set SRAM Bank 1 to when in STOP mode
 *                        One of @ref DL_SYSCTL_SRAM_BANK1_POWER_LEVEL_STOP_MODE
 *
 */
__STATIC_INLINE void DL_SYSCTL_setSRAMBank1PowerLevelInSTOP(
    DL_SYSCTL_SRAM_BANK1_POWER_LEVEL_STOP_MODE powerLevel)
{
    DL_Common_updateReg(&SYSCTL->SOCLOCK.SRAMCFG,
        (uint32_t)(powerLevel | SYSCTL_SRAMCFG_KEY_VALUE),
        (SYSCTL_SRAMCFG_BANKSTOP1_MASK | SYSCTL_SRAMCFG_KEY_MASK));
}

/**
 *  @brief  Get the power level SRAM Bank 1 power when in STOP mode
 *
 *  @return The power level of SRAM Bank 1 when in STOP mode
 *
 *  @retval  One of @ref DL_SYSCTL_SRAM_BANK1_POWER_LEVEL_STOP_MODE
 */
__STATIC_INLINE DL_SYSCTL_SRAM_BANK1_POWER_LEVEL_STOP_MODE
DL_SYSCTL_getSRAMBank1PowerLevelInSTOP(void)
{
    uint32_t powerLevel =
        SYSCTL->SOCLOCK.SRAMCFG & SYSCTL_SRAMCFG_BANKSTOP1_MASK;
    return (DL_SYSCTL_SRAM_BANK1_POWER_LEVEL_STOP_MODE)(powerLevel);
}

#ifdef __cplusplus
}
#endif

#endif /* ti_dl_m0p_dl_sysctl_sysctl__include */
/** @}*/
